"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 9. Дано масив імен. 
// Сформувати масив з перших літер цих імен.



if (confirm('Почати тестування?')) {

	const names = ['Таня', 'Глеб', 'Іван', 'Коля', 'Василь', 'Ваня', 'Іван', 'Валя']
	//======================================================================
	document.write(`Є масив імен ${names} <hr>`)
	document.write(`<p> Результат: </p>`)
	let newArray = []
	//======================================================================
	// ForOf
	for (const name of names) {
		newArray.push(name[0])
	}
	//======================================================================



	//======================================================================
	document.write(`Новий масив: <br> ${newArray} <br>`)

}

