"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 3. Користувач вводить кількість елементів. Створити масив,
// у якому перші 5 елементів заповнені 1-цями,
// а інші до кінця масиву заповнені 7-ками.

if (confirm('Почати тестування?')) {


	const userNumber = parseInt(prompt('Введіть кількість елементів масиву', '15'))

	const userArray = new Array(userNumber).fill(1, 0, 5).fill(7, 5)


	document.write(`Масив - ${userArray}<br>`)

}

