"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 10. Дано масив цін у грн. 
// Податок складає 20%. Сформувати масив, 
// який буде містити величину сплаченого податку у грн



if (confirm('Почати тестування?')) {

	const prices = [20, 50, 450, 30, 680, 15, 20]
	//======================================================================
	document.write(`Є масив цін ${prices} <hr>`)
	document.write(`<p> Результат: </p>`)

	let sumTax = 0

	//======================================================================
	// .map
	const taxArray = prices.map((price) => price * 0.2)
	//======================================================================
	// ForOf
	// let taxArray = []
	// for (const productPrice of prices) {
	// 	taxArray.push(productPrice * 0.2)
	// }
	//======================================================================
	for (const productTax of taxArray) {
		sumTax += productTax
	}
	//======================================================================
	document.write(`Масив податку с кожного продукту: <br> ${taxArray} <br>`)
	document.write(`Загальна сума податку: <br> ${sumTax} грн. <br>`)


}

