"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 7. Дано масив цін. Змінити цей масив так, 
// що на ціни товарів, які більші за 1000 грн. дати 30% знижки



if (confirm('Почати тестування?')) {

	const someArray = [500, 1700, 2300, 960, 1700, 4000, 750, 300, 1400]
	//======================================================================
	document.write(`Є масив  ${someArray} <hr>`)
	document.write(`<p> Результат: </p>`)
	//======================================================================
	// Цикл ForEach
	someArray.forEach((element, index, baseSomeArray) => {
		if (element > 1000) {
			baseSomeArray[index] = (baseSomeArray[index] * 0.7).toFixed(2)
		}
	});
	//======================================================================
	// Звичайний цикл
	// for (let i = 0; i < someArray.length; i++) {
	// 	if (someArray[i] > 1000) {
	// 		someArray[i] = (someArray[i] * 0.7).toFixed(2)
	// 	}
	// }
	//======================================================================
	document.write(`Змінений масив: <br> ${someArray} <br>`)

}

