"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 1. Користувач вводить кількість елементів. Створити масив, 
// що складається з  вказаної кількості елементів заповнених нулями.

if (confirm('Почати тестування?')) {

	const userNumber = parseInt(prompt('Ведіть кількість елементів масиву', '10'))

	let userArray = new Array(userNumber).fill(0)

	document.write(`Масив - ${userArray} <br>`)

}

