"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача 8. Дано масив номерів авто. 
// Сформувати новий масив тих, які починаються на «А»



if (confirm('Почати тестування?')) {

	const numbersCar = ['AX2543AO', 'BH4435A', 'AK1234KA', 'BP100KA', 'K34K', 'A25O']
	//======================================================================
	document.write(`Є масив номерів авто ${numbersCar} <hr>`)
	document.write(`<p> Результат: </p>`)
	let newArray = []
	//======================================================================
	// ForOf
	for (const numberCar of numbersCar) {
		if (numberCar[0] === 'A') {
			newArray.push(numberCar)
		}
	}
	//======================================================================
	// Звичайний цикл
	// for (let i = 0; i < numbersCar.length; i++) {
	// 	if (numbersCar[i][0] === 'A') {
	// 		newArray.push(numbersCar[i])
	// 	}
	// }
	//======================================================================
	document.write(`Новий масив: <br> ${newArray} <br>`)

}

