"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// Задача №10
// Вивести на екран N абзаців (N вводиться користувачем).

// if (confirm('Почати тестування?')) {
const N = parseInt(prompt('Введіть кількість обзаців', '4'))

for (let i = 1; i <= N; i++) {
	document.write(`<h1> Заголовок ${i}`)
	for (let j = 1; j <= N; j++) {
		document.write(`<p> Розділ ${i}, параграф ${j} <p><hr>`)
	}
	document.write('</h1>')
}


// }
