"use strict"

// Крок 0. Позначення даних
// Крок 1. Введення даних:
// Крок 2. Обчислення
// Крок 3. виведення результату


// While_DoWhile. Задача №3
// З клавіатури вводиться початкове значення суми.
// Поки сума є меншою за 100 додавати до неї числа,
// які вводяться з клавіатури.

if (confirm('Почати тестування?')) {

	let userSum = parseInt(prompt('Введіть початкову суму до 100'))
	while (userSum < 100) {
		let addSum = parseInt(prompt(`Сума = ${userSum} додайте ще`))
		userSum += addSum
	}
	document.write(`Загальна сума = ${userSum} <br>`)
}
